from logic.ExperienceTable import ExperienceTable

#**
#* サマルトリアの王子の経験値一覧。
#*/
class サマルトリアの王子の経験値(ExperienceTable):
	#**
	#* 基底クラスを初期化し経験値テーブル情報を構築。
	#*/
	def __init__(self):
		#**
		#* 経験値テーブル。
		#*/
		super().__init__(
			[
				0,
				24,
				60,
				110,
				200,
				380,
				700,
				1300,
				2400,
				4000,
				6000,
				8200,
				11000,
				15000,
				19000,
				24000,
				29000,
				36000,
				45000,
				56000,
				69000,
				85000,
				100000,
				116000,
				134000,
				156000,
				182000,
				210000,
				240000,
				280000,
				310000,
				340000,
				380000,
				430000,
				480000,
				520000,
				580000,
				640000,
				700000,
				760000,
				820000,
				840000,
				900000,
				960000,
				1000000
			])