from logic.ExperienceTable import ExperienceTable

#**
#* ムーンブルクの王女の経験値一覧。
#*/
class ムーンブルクの王女の経験値(ExperienceTable):
	#**
	#* 基底クラスを初期化し経験値テーブル情報を構築。
	#*/
	def __init__(self):
		super().__init__(
			#**
			# 経験値テーブル。
			#/
			[
				0,
				100,
				300,
				600,
				1200,
				2400,
				4200,
				6400,
				9000,
				12000,
				16000,
				20000,
				25000,
				31000,
				39000,
				50000,
				65000,
				83000,
				103000,
				125000,
				150000,
				180000,
				220000,
				270000,
				300000,
				330000,
				360000,
				400000,
				450000,
				540000,
				630000,
				730000,
				820000,
				910000,
				1000000
			])
